Revit 2027 API
PanelScheduleData.AddLoadClassification Method
 Add a Load Classification Id to the array of Load Classifications.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AddLoadClassification(
	ElementId loadClassficationId
)
Public Function AddLoadClassification (
	loadClassficationId As ElementId
) As Boolean
public:
bool AddLoadClassification(
	ElementId^ loadClassficationId
)
member AddLoadClassification :
        loadClassficationId : ElementId -> bool
Parameters
loadClassficationId ElementId
 The load classification to add
Return Value
Boolean
 True if success; false if the given Id has already existed.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace